tap "borgbackup/tap"
tap "buo/cask-upgrade"
tap "d12frosted/emacs-plus"
tap "golangci/tap"
tap "hhvm/hhvm"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "timescale/tap"
brew "xz"
brew "ansible"
brew "ansible-lint"
brew "apr-util"
brew "aspell"
brew "gettext"
brew "libffi"
brew "python@3.9", link: false
brew "glib"
brew "atk"
brew "m4"
brew "autoconf"
brew "automake"
brew "awscli"
brew "azure-cli"
brew "bash"
brew "bazel"
brew "bazelisk", link: false
brew "berkeley-db", link: true
brew "berkeley-db@4"
brew "binutils"
brew "bison"
brew "boost"
brew "buildifier"
brew "pkg-config"
brew "cairo"
brew "llvm"
brew "ccls"
brew "cmake"
brew "coreutils", link: false
brew "openldap"
brew "curl"
brew "krb5"
brew "cyrus-sasl"
brew "diffutils"
brew "dockutil"
brew "double-conversion"
brew "expat"
brew "gflags"
brew "glog"
brew "libevent"
brew "lz4"
brew "snappy"
brew "folly"
brew "libsodium"
brew "libtool"
brew "guile"
brew "unbound"
brew "gnutls"
brew "gobject-introspection"
brew "harfbuzz"
brew "libass"
brew "zeromq"
brew "ffmpeg"
brew "gcc"
brew "open-mpi"
brew "file-formula"
brew "flex"
brew "gawk"
brew "gdk-pixbuf"
brew "gifsicle"
brew "git", link: false
brew "libgpg-error"
brew "libgcrypt"
brew "gnupg"
brew "gpgme"
brew "gmime"
brew "go"
brew "go-bindata"
brew "go-md2man"
brew "gopls"
brew "gpatch"
brew "gradle"
brew "pango"
brew "librsvg"
brew "graphviz"
brew "gsettings-desktop-schemas"
brew "gtk+3"
brew "gzip"
brew "hidapi"
brew "htop"
brew "hub"
brew "hugo"
brew "shared-mime-info"
brew "imagemagick"
brew "inlets"
brew "intltool"
brew "ipython"
brew "ispell"
brew "istioctl"
brew "isync", restart_service: true
brew "jemalloc"
brew "jq"
brew "kubernetes-cli"
brew "ldns"
brew "less"
brew "libgsf"
brew "libgusb"
brew "libhandy"
brew "libpgm"
brew "libslirp"
brew "libunwind-headers"
brew "libvterm"
brew "libxml2"
brew "links"
brew "mailutils"
brew "make"
brew "mas"
brew "minikube"
brew "miniupnpc"
brew "mp3info"
brew "msmtp"
brew "xapian"
brew "mu"
brew "multimarkdown"
brew "mysql-client"
brew "ninja"
brew "nmap"
brew "node"
brew "nss"
brew "oauth2l"
brew "openapi-generator"
brew "openssl@3"
brew "p7zip"
brew "plantuml"
brew "qt"
brew "poppler"
brew "postgresql"
brew "protobuf"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pyenv-virtualenvwrapper"
brew "tcl-tk"
brew "python@3.8", link: true
brew "qemu"
brew "qt@5"
brew "r"
brew "ruby-build"
brew "rbenv"
brew "rename"
brew "ripgrep"
brew "rsync"
brew "ruby"
brew "s3cmd"
brew "sane-backends"
brew "scc"
brew "screen"
brew "shfmt"
brew "simple-scan"
brew "sloccount"
brew "subversion"
brew "syncthing", restart_service: true
brew "topgrade"
brew "transmission-cli"
brew "tree"
brew "unzip"
brew "vegeta"
brew "vim"
brew "vips"
brew "watch"
brew "watchexec"
brew "watchman", link: false
brew "websocat"
brew "wget"
brew "yarn"
brew "yq"
brew "borgbackup/tap/borgbackup-fuse"
brew "d12frosted/emacs-plus/emacs-plus@27", args: ["with-mailutils", "with-nobu417-big-sur-icon"]
brew "golangci/tap/golangci-lint"
cask "aldente"
cask "alfred3"
cask "android-file-transfer"
cask "android-platform-tools"
cask "anki"
cask "anylist"
cask "docker"
cask "firefox"
cask "font-source-code-pro"
cask "gimp"
cask "google-chrome-beta"
cask "google-cloud-sdk"
cask "google-earth-pro"
cask "googleappengine"
cask "gutenprint"
cask "handbrake"
cask "iterm2"
cask "karabiner-elements"
cask "macfuse"
cask "mactex"
cask "monero-wallet"
cask "mono-mdk"
cask "ngrok"
cask "plex"
cask "rar"
cask "signal"
cask "spotify"
cask "tor-browser"
cask "transmission"
cask "virtualbox"
cask "visual-studio-code-insiders"
cask "vlc"
cask "vorta"
cask "whatsapp"
cask "wireshark"
cask "xquartz"
cask "zoom"
