tap "buo/cask-upgrade"
tap "caarlos0/tap"
tap "d12frosted/emacs-plus"
tap "golangci/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "railwaycat/emacsmacport"
brew "openssl@1.1"
brew "apr-util"
brew "autoconf"
brew "automake"
brew "readline"
brew "xz"
brew "awscli"
brew "bash"
brew "binutils"
brew "bison"
brew "borgbackup"
brew "gettext"
brew "libffi"
brew "glib"
brew "cairo"
brew "cmake"
brew "coreutils"
brew "curl"
brew "diffutils"
brew "dockutil"
brew "libtool"
brew "pkg-config"
brew "gnutls"
brew "gobject-introspection"
brew "harfbuzz"
brew "ffmpeg"
brew "file-formula"
brew "flex"
brew "gawk"
brew "gcc"
brew "gdb"
brew "gifsicle"
brew "git"
brew "global"
brew "libgpg-error"
brew "gmime"
brew "go"
brew "go@1.14"
brew "gpatch"
brew "pango"
brew "graphviz"
brew "gzip"
brew "htop"
brew "hub"
brew "hugo"
brew "intltool"
brew "ispell"
brew "isync", restart_service: true
brew "jq"
brew "ldns"
brew "less"
brew "libvterm"
brew "links"
brew "m4"
brew "mailutils"
brew "make"
brew "mas"
brew "msmtp"
brew "xapian"
brew "mu"
brew "multimarkdown"
brew "mysql-client"
brew "node@10", link: true
brew "nss"
brew "p7zip"
brew "plantuml"
brew "postgresql"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pyenv-virtualenvwrapper"
brew "python@2", link: false
brew "python@3.7", link: true
brew "ruby-build"
brew "rbenv"
brew "ripgrep"
brew "rsync"
brew "ruby"
brew "s3cmd"
brew "scc"
brew "screen"
brew "shellcheck"
brew "sloccount"
brew "subversion"
brew "syncthing", restart_service: true
brew "topgrade"
brew "tree"
brew "unzip"
brew "vim"
brew "watch"
brew "watchexec"
brew "watchman"
brew "websocat"
brew "wget"
brew "wrk"
brew "caarlos0/tap/org-stats"
brew "golangci/tap/golangci-lint"
cask "anki"
cask "borgbackup"
cask "dropbox"
cask "emacs-mac-spacemacs-icon"
cask "firefox"
cask "font-source-code-pro"
cask "gimp"
cask "google-earth-pro"
cask "iterm2"
cask "karabiner-elements"
cask "ngrok"
cask "spotify"
cask "tor-browser"
cask "transmission"
cask "vlc"
cask "vorta"
cask "zoomus"
mas "Amphetamine", id: 937984704
mas "Magnet", id: 441258766
mas "WireGuard", id: 1451685025
