# Taps
tap "borgbackup/tap"
tap "buo/cask-upgrade"
tap "d12frosted/emacs-plus"
tap "golangci/tap"
tap "homebrew/bundle"
tap "homebrew/services"

# Build tools
brew "autoconf"
brew "automake"
brew "bazel"
brew "bazelisk", link: false
brew "binutils"
brew "bison"
brew "boost"
brew "buildifier"
brew "cmake"
brew "diffutils"
brew "flex"
brew "gcc"
brew "make"
brew "ninja"
brew "pkg-config"

# Languages & runtimes
brew "bash"
brew "go"
brew "gopls"
brew "node"
brew "python@3"
brew "pyenv"
brew "pyenv-virtualenv"
brew "ruby"
brew "ruby-build"
brew "rbenv"
brew "rust"

# DevOps & cloud
brew "ansible"
brew "ansible-lint"
brew "awscli"
brew "azure-cli"
brew "docker"
brew "google-cloud-sdk"
brew "istioctl"
brew "kubernetes-cli"
brew "minikube"
brew "vault"

# Editors
brew "vim"
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-mailutils", "with-native-comp"]

# VCS & code tools
brew "git"
brew "hub"
brew "golangci/tap/golangci-lint"
brew "openapi-generator"
brew "protobuf"
brew "ripgrep"
brew "scc"
brew "shfmt"

# Networking & security
brew "curl"
brew "gnupg"
brew "gpgme"
brew "ldns"
brew "nmap"
brew "nss"
brew "openldap"
brew "openssl@3"
brew "wget"

# Data & databases
brew "jq"
brew "mysql-client"
brew "postgresql"
brew "yq"

# Mail
brew "gmime"
brew "isync", restart_service: true
brew "mailutils"
brew "msmtp"
brew "mu"

# Media & graphics
brew "ffmpeg"
brew "gifsicle"
brew "graphviz"
brew "imagemagick"
brew "plantuml"
brew "vips"

# Terminal & shell
brew "coreutils", link: false
brew "gawk"
brew "gzip"
brew "htop"
brew "less"
brew "p7zip"
brew "rename"
brew "rsync"
brew "s3cmd"
brew "screen"
brew "syncthing", restart_service: true
brew "topgrade"
brew "tree"
brew "unzip"
brew "watch"
brew "watchexec"

# Misc
brew "aspell"
brew "hugo"
brew "multimarkdown"
brew "borgbackup/tap/borgbackup-fuse"

# Casks — GUI applications
cask "aldente"
cask "anki"
cask "docker"
cask "firefox"
cask "font-source-code-pro"
cask "gimp"
cask "google-chrome"
cask "google-cloud-sdk"
cask "handbrake"
cask "iterm2"
cask "karabiner-elements"
cask "macfuse"
cask "mactex"
cask "ngrok"
cask "signal"
cask "spotify"
cask "tor-browser"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "vorta"
cask "whatsapp"
cask "wireshark"
cask "xquartz"
cask "zoom"
